property_id,property_name,price,reviewer_name,reviewer_comment
9651871,"Über den Dächern Berlins Zentrum",9000,Claude,"Nous avons déjà expliqué directement à David ce qui n'allait pas. Son appartement est très poussiéreux et très mal rangé ni rangeable. Il n'est pas en état d'être loué. La cuisine n'est pas utilisable, tous les instruments sont sales, collants. Seule la salle de bain et le couchage étaient acceptables. Nous avons bien dormi, mais pas moyen de prendre un repas à l'intérieur. Avant de recommencer à louer, David a besoin de se faire conseiller. Bon contact cependant avec David, qui est aimable et de bonne volonté. Bonne situation."
28462345,"Berlin Apartment Friedrichshain",8600,Aaron,"The host canceled this reservation 8 days before arrival. This is an automated posting."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Damian,"Super friendly guys, very welcoming and nice large room. Flexible check in and very easy to get to as right by Charlottenberg. The down side was the guys having friends around and playing quite loud music up till 230am. Not sure this place would suit lone female travellers."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Philipp,"Ich war sehr zufrieden mit der Unterkunft! Es handelt sich um eine WG mit sehr netten Leuten, alles sauber und wie beschrieben. Ich würde sofort wieder kommen :)"
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Nishan,"Reinkommen und sich wie zu Hause fühlen!
In dieser WG wurde ich empfangen als wäre ich längst ein Mitbewohner! In einer großen Charlottenburger Altbauwohnung mit frisch saniertem Bad ließ es sich bequem leben. Die Jungs in der WG sind äußerst nett, hilfreich und kommunikativ. Tolle Lage im Berliner Westen mit Einkaufsmöglichkeiten um die Ecke.
Von mir eine klare Empfehlung!!!"
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Donald,"Max and his roommates were outstanding hosts. I stayed there for a short time but felt very welcome and immediately clicked with everybody. They only recently moved into the place so they’re not fully settled in, however if you’re looking for affordable, clean, safe accommodation at a decent accessible location, then this is your place.!"
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Henrik,"Max wohnt mit anderen Jungs zusammen in einer schönen Altbauwohnung in Charlottenburg. Alle sind sehr freundlich und das Klima ist super angenehm. Meine späte Anreise war gar kein Problem und ich konnte auch meine Sachen über den Tag noch bei den Jungs in der Wohnung lassen. Die Lage war für mich optimal und mit der guten Anbindung über den S-Bahnhof Charlottenburg ist man schnell in der Innenstadt oder am Ku'damm. Ich kann die Unterkunft sehr empfehlen und würde auch wieder eine Nacht verbringen."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Krizza,"Max, Felix and especially Lucas, they are really nice and very friendly. They are so easy to deal with and I feel very comfortable staying at their place. It was a great experience. Till next time. See you again guys. Xx HIGHLY RECOMMEND."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Sarah,"I booked with the guys for a beloved friend, already in Berlin, who had been caught off-guard by unacceptable and unwelcoming accommodations. 

The flat has a brilliant location--truly couldn't be better, is comfortably furnished, clean, safe, and the guys themselves are absolutely wonderful. They're kind, welcoming, intelligent, responsible, and extremely thoughtful hosts. I'm confident that one could not do better than to be able to stay with them in Berlin. 

There simply aren't enough stars to give!

*******************"
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Yue,"max很热心,给了很多柏林旅游的建议,住着也比较舒服"
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Saskia,"Alles in allem war die Unterkunft sehr gut und ist nur weiter zu empfehlen."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Nick,"Good location, funny guys but it was quite noisy at night."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Habiba,"‭ All of the boys were such attentive and helpful hosts throughout the whole trip. The place is absolutely nice and well equipped, it’s located quite central so you can go everywhere by train and you have a lot of restaurants and bars around you.
I would recommend this place to everyone who wants to have a unique experience in Berlin. 
We will definitely be back for another trip. Thank you guys for sharing your home."
21479879,"Spacious stylish flat for your New Year in Berlin",8000,Frederik,"Alles bestens, super nette Jungs, gerne wieder."
25757977,"Axel City Room at TWO Hotel Berlin by Axel",6000,Khalida,"Excellent value, very clean, lovely receptionists, casual atmosphere, great location, smart spa"
25757977,"Axel City Room at TWO Hotel Berlin by Axel",6000,Mulaw,Keine.
25757977,"Axel City Room at TWO Hotel Berlin by Axel",6000,Jay,"ultra modern!  so high tech, I had to keep checking what year it was. making sure I didn't get drunk, pass out, and wake up 500 years in the future!"
25802565,"Axel Single Room at TWO Hotel Berlin by Axel",6000,NULL,NULL
25802651,"Axel Single Room with Breakfast at TWO Hotel Berlin by Axel",6000,NULL,NULL
25802838,"Axel Junior Suite with Breakfast at TWO Hotel Berlin by axel",6000,NULL,NULL
25759146,"Axel City with Breakfast at TWO Hotel Berlin by Axel",6000,Gunter,"Das gesamte Haus ist sehr hochwertig ausgestattet und strahlte eine wohltuende Ruhe aus. Das Personal ist sehr freundlich. 
Ganz besonders hat uns gefallen, dass in diesem Hotell Hetero-Paare willkommen sind. Ein besonderes Highlight ist das Frühstück auf der Dachterasse mit Blick über Berlin.
Wir haben uns sehr wohl gefühlt. "
25803117,"Axel Suite with Breakfast at TWO Hotel Berlin by Axel",6000,NULL,NULL
25802909,"Axel Suite at TWO Hotel Berlin by Axel",6000,NULL,NULL
