property_id,property_name,price,reviewer_name,reviewer_comment
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Thorbjørn,"Great place to stay. I enjoyed every minute. Raafat is a great host. He is very friendly and knows how to make his guests feel at home. The room is great and the wifi is fast and stabil."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Peter,"Vielen Dank für die nette und unkomplizierte Gastfreundlichkeit"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Hansel,"Great room with big window, good for explore the city!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Meghan,"Walking distance from the main central station, easy check in, and clean room. Thanks for hosting! "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Gaston,"Buen lugar por el precio. Buena ubicación, cerca de la estación central de trenes."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Anu,"Raafat was a great host who welcomed us when we checked in and made sure we were comfortable. He was completely non intrusive and we didnt see much of him that allowed us to relax in the hall as well. The location is also great and close to the central station that helps in travelling around the city."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Vincent,"Raafat is very welcoming but we didn't see each other much because he works a lot. "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Leonardo,"sehr freundlich,  und schöne Lage"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Nichola,"Perfect location for getting around the city- well connected and close to the station. Great value for a long weekend, Raafat was easy to communicate with and left us to our own devices."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Tomas,"It is a great place to stay, all the people that lived there were very friendly. There were no curtains in the bedroom though, but that didn't bothered me much."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Panagiota,"A simple spacious room in the center of the city. I loved the thing that in 5 min walking you were on the river and in 10 in Brandenburg gate. Kind and friendly host!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Moana,unkompliziert
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Luca,"Everything was as described, Raafat is really kind and the place is nice. Great value for this price. City center is close. Recommended for everyone!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Milica,"If you want kind and not complicated host choose Raafat. He’s also very accurate and place it’s close to the city center"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Valeria,"Excelente anfitrión ! Muy serviciales! La casa muy espaciosa! Nuestra estancia fue genial! Gracias!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Borja,"Raafat is a good host and he help with all your questions or needs in the arrival or to know Berlin, my days in his flat were nice and there weren't any problem."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Rachel,"Location, location, location! You truly cannot beat this proximity to the main train station in Berlin, with an Aldi right across the street. Raafat greeted us as soon as we arrived and provided a great tip for dinner! He was very easy going and shared all common spaces. His English was also impressive! Would definitely stay here again. "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Edita,"It was warm welcome by the host, good communication. Our room spacious and comfortable. Perfectly situated close to the main train bus, tram, station. Safe suburb. We felt like at home. Also we had a great time with the host Lafi. Highly recommended :)"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Kevo,"Very central and close to the Main Train Station"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Erycka,"The room is very nice, our problem was communication with him, he doesn’t speak English. We expected him to give us a map of the city and recommend us some places, he said we can check with our phone. When we arrived the house was a little dirty and there were ants all over the house."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Maria,"Raafat’s place is very nice! We had a big room with a lot of space. His location is great, only a 20 minute walk to Reichstag Building. We were able to use the kitchen and made dinner one night. He let us checkin early too which was very nice!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Leandro,
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Jon,"Very nice guy, easy to get ahold of and very friendly. The bed was hard to sleep in because it was so hard. And it was not the cleaning place, but overall it was a decent place for a few nights "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,博华,"Raafat ist nett und die Antwort ist sehr schnell."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Jana,"Der Gastgeber war sehr gastfreundlich und nett, jedoch war das Bett leider nicht 1,80 Meter breit wie angegeben sondern nur 1,20 Meter breit. Leider war auch das Badezimmer nicht sehr sauber und ob das Bett wirklich frisch bezogen war, ist fraglich."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Lawrence,"The place had everything that was advertised at a great price. The host was friendly and contrary to another review he spoke English well. I would certainly stay here again!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Camila,"Rafaat es un excelente anfitrión, respondió rápidamente nuestras consultas, se preocupó en todo momento de ayudarnos en cada duda, nos facilitó transporte al aeropuerto y hasta nos hizo un tour turístico por la ciudad sólo por ayudarnos. Es verdaderamente un tremendo anfitrión. Su hogar es tal cual como aparece en las fotografías, camas muy cómodas y habitaciones con calefacción y wifi incluída. Está muy bien ubicado, harta conexión y locomoción para salir a pasear. Realmente muy recomendable. Fué un verdadero agrado alojar aquí."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Alejandra,"Rafaat's place is really close to Houfbanhof station which is one of the main train, bus, and tram station of Berlin, you can find it really easy and it's way to close to the main spots in the city. Also communication with him was awesome, he was really nice with us :) "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Jennet,"Raafat ist sehr gastfreundlich, hilfsbereit, nett. Hat gute Tips für Berlin. Super Preis-Listungs Verhältnis. Mir hat alles gut gefallen ein sehr schöner Aufenthalt. Sehr gerne wieder . Vielen Dank nochmal für alles."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Veronica,"Our stay was nice and  Raafat is very helpful"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Jonatan,"
"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Giwrgos,"Cool guy, very good host everything was great ."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Lucy,"Amazing location, really friendly host. Very welcoming and the room was perfect for what we needed."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Aroa,"Fantástica la estancia. Muy acogedora la habitación y muy cerca del centro para ir a pie. También tienes al lado la estación para moverte. Nos ha gustado mucho y la recomendamos 100%. Ahmad ha sido muy majo y simpático con nosotras."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Mary,"Отличное соотношения цена/качество. Удобное расположение, мы пешком ходили в центр города. Благодаря расположению у HauptBahnHof не возникнет проблем транспортом добраться до любой точки. 

Комната большая, светлая. Если вы не привереды в отношении кухни, общих зон, то Вам точно все понравится."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Ellen,"Super Lage, tolle Kommunikation- alles gut!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Cesia,"Raafat  es una persona amable, atenta y cordial.  Sin duda pasamos una gran estancia"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Mikkel,"Nice location, great and friendly host! Definitely great value for money! I give my recommendations for those who want a good bed in simple surroundings and at a very nice location."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Sarah,"Das check-in und - out waren sehr flexibel"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Daniel,"Relación calidad/precio excelente. Muy bien ubicado, limpio, agradable y amplio. Lo recomiendo completamente."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Kristin,"Raafat ist ein sehr freundlicher Gastgeber, dessen Wohnung geräumig ist und zentral liegt. Die Sauberkeit ist ausbaufähig. :)"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Michael,"great location near HBF,host was helpful with local transportation assistance"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Nicole,"Rafaat war sehr nett und bemüht uns einen angenehmen Aufenthalt in Berlin zu bescheren. Wir haben 3 Nächte in der Unterkunft verbracht und waren im großen und ganzen zufrieden. 
Gute Unterkunft für wenig Geld!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,David,"Excellente , Raafat it's a great person!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,华,"Raafat ist ein sehr freunlicher Gastgeber. Die Lage ist sehr günstig. Wenn du nach Berlin reist, ist sein Zimmer eine gute Wahl."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,"Carlos Jaser","Très bien !"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Emily,"Everything was good and the host was friendly. The location is only 6 minutes walking distance from the Berlin central station. There's also an Aldi nearby to buy some essentials."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Fede,"Buen anfitrión, atento. Lo mejor es la ubicacion llegas en tren a todos lados. Solo agregaría unas cortinas en la ventana de la pieza ya que entra mucho sol ( en primavera como fui amanece antes de las 5 am ) la habitación es grande y espaciosa"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Paola,"El alojamiento es tal cual como se ve en las  fotos, estuvo bien. Raafat fue  servicial y atento!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,"芝寅 Chihyin","With an open-minded man, my friend and I had a great stay with high degree of freedom. 
And the location as well as the price is awesome."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Mitch,"The host canceled this reservation 81 days before arrival. This is an automated posting."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Adam,"Without any problems, Raafat is a cool dude."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Anastasia,"Raafat is a great host, he prepared everything, gave my friend and me some local tips and was there every time I had questions. The location is perfect if you are a traveler, Hauptbahnhof is in 10-15 min walk. The place is clean, he even gave me an extra towel and shared some water/meals."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Kaitlyn,"Great location a few minutes walk from the HBF, 10 min walk from restaurants. Quiet building. "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Levi,"Raafat was very accommodating with our schedule.  Our space was clean, we enjoyed the plants, and location was convenient to all transit.  We would absolutely stat with Raafat again!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Iulia,"Raafat was very nice and gave us the privacy we desired."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Ірина,"Vielen Dank. Underestimated Reuse war wunderbar."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,"Dani Y Sebas"," Nuestra estancia fue muy agradable, Raafat fue muy amable y estuvo pendiente de todo. La habitacion está a 10 min de la estación central, muy fácil para llegar. La recomendamos 100%."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Mariia,"Raafat is a kind and tolerant host. The main advantage of the apartment is its location close to the main attractions and the main railway station. However, the area around is very quiet and safe, contrary to our ideas. If you are not a bore, and do not pay attention to the shortcomings, then this accommodation is for you. We stayed with a small child and everything was fine."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Nikita,"Если вы хотите найти место, где можно будет отлично пожить в Берлине - это то, что нужно. У Рафата прекрасное расположение квартиры - вы можете завтракать у Рейхстага каждое утро в шаговой доступности от главного ЖД вокзала (а так же станции метро), рядом есть магазины и сам центр в 10-15 минутах ходьбы.
Сам Рафат очень, очень добрый и уважительный человек. Готов помочь по возникщим вопросам, очень гостеприимный. В комнате очень просторно, вся мебель в прекрасном состоянии. Так же очень хорошая кухня и зал, замечательный вид из окна.

If you want find a pl"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Jennifer,"Alles super. Sehr höflich und kam mir beim einchecken sehr entgegen. Gerne wieder"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Aryssa,"Raafat was super friendly and accommodating even when our train was delayed for an hour. When we arrived he gave us a giant bottle of much appreciated cold water. Overall our stay in Berlin was fantastic!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Lieke,"Very nice place, great location, friendly host. "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Karla,"Optimale Unterkunft, große Gastfreundschaft, nah am Bahnhof. Der Aufenthalt hat unsere Erwartungen übertroffen! :-)"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Mirco,"Bahnhof nah und günstig. Sauberkeit nicht ganz so Top."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Anaísa,.
22739713,"Schöne Zimmer in der Nähe vom Hb",1,"Tran Bao-Nhi","Raafat war sehr freundlich :)"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Adriana,"Raafat was a nice host, my flight was in late and he waited me for the check-in. The room was properly clean and the apartment is nice and furthermore the position is great since it is near the main station. "
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Rhylee,"Very very close to everything you could want to see, very friendly host. Would recommend!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Yusuke,"That's grate"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Floris,"The room is Nice and big with a pretty view and a big window. The location is good. Perfect room for couples who want to explore Berlin or travellers in need of a place to sleep."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Shouyun,"very close to hbf, big and clean room. Raafat is very kind."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Athanasios,"Close to the central train station."
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Ozélie,"L'appartement de Raafat est super bien situé et permet d'accéder facilement à la ville et à ses alentours avec le train qui se situe à côté. L'accueil fut super, Raafat est très gentil et arrangeant; la chambre est aussi très agréable ! Je recommande !

Raafat's apartment is in a great location and offers easy access to the city and its surroundings with the train next door. The welcome was great, Raafat is very kind and accommodating; the room is also very nice! I recommend !"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Chad,"Careful if you’re 6’2” like I am you might hit your head on a light. Great stay. Very close to the Central Train station! For the price more than I could ask for!"
22739713,"Schöne Zimmer in der Nähe vom Hb",1,Lau,"If you have a lot of baggage that you want to drop them first, make sure the host is in the house in that period of time."
21911198,"Single bed in a small cosy appartement.",8,Armando,"Dhia was a perfect host..very flexible and available regarding my needs. The place is small but very welcoming and not far from the centre. Suggested. Thx Dhia ;)"
21911198,"Single bed in a small cosy appartement.",8,Hélio,"Dhia is a great host. Was very cool to meet him and his place is cozy and nice, and the bed comfortable!

He also makes some great Tunisian dishes and made me a meal, so I couldn’t be happier!!:))"
21911198,"Single bed in a small cosy appartement.",8,동영,"테겔공항에서 멀지 않습니다. 
원룸이라 같은 공간에서 지내야하는게 불편할 수 있지만 호스트가 친절해서 괜찮았습니다. 
가성비 좋습니다."
21911198,"Single bed in a small cosy appartement.",8,Sean,"Dhia was a wonderful host and makes you feel at home in his apartment. The apartment was very clean and I highly recommend staying with him if you are looking to stay in Berlin. Thank you for being a great host!"
21911198,"Single bed in a small cosy appartement.",8,Leif,"Die Gastfreundschaft war echt super. Ich habe mich bei Dhia wohl gefühlt und kann einen Aufenthalt nur weiterempfehlen. Bis zum nächsten Mal "
21911198,"Single bed in a small cosy appartement.",8,Simone,"Dhia hosted me for three days. He's been very kind and always answered me very fast. I recommend his flat to anyone who's looking for something cheap but for someone very polite."
21911198,"Single bed in a small cosy appartement.",8,Varvara,"Dhia was a really nice host. Helping with places to visit and transport planning. Talking about all kinds of things was nice too."
21911198,"Single bed in a small cosy appartement.",8,Oussama,"Dhia is such a great Host. He's a welcoming person, generous and cool. His home is clean. It was a perfect stay !"
24452824,"Nice room in a super-central, great apartment",8,Nicolas,"Paolo was a great Host, very friendly and talkative. He did his best to welcome us in his nice apartment.
Would definitely recommend him and would come back here anytime soon!"
24452824,"Nice room in a super-central, great apartment",8,Luca,"Soggiorno perfetto. Paolo e la sua ragazza sono degli host fantastici. Sempre gentili e attenti alle esigenze dei loro ospiti. La stanza è pulita e spaziosa mentre la casa è posizionata benissimo per raggiungere qualsiasi punto di Berlino. Consigliato al 100%. "
24452824,"Nice room in a super-central, great apartment",8,Candice,"Paolo and Hanna's place is in a very central location and they were so welcoming! Communication was great and they also gave me so many recommendations for restaurants and places to visit. Very organized and relaxed environment. Definitely would stay here again! Thank you so much for hosting me :) "
24452824,"Nice room in a super-central, great apartment",8,Golrokh,"Paolos Apartment ist sehr zu empfehlen. Er ist sehr nett und hilfsbereit. Die Wohnung ist schön, hell, sauber und liegt zentral. Die Beschreibung der Wohnung passt genau. Jeder Zeit wieder und danke."
24452824,"Nice room in a super-central, great apartment",8,Tito,"Paolo was an outstanding host from start to finish. His place is easily accessible by public transportation and in a great location to explore Berlin on foot. The room was as described, clean and well set up, only a few steps from the shared bathroom. Would definitely recommend."
24452824,"Nice room in a super-central, great apartment",8,Jeffrey,"Paolo's place was very clean and pleasant. We really enjoyed our stay there."
24452824,"Nice room in a super-central, great apartment",8,YiJing,"Hosts are absolutely lovely!"
24452824,"Nice room in a super-central, great apartment",8,Veerle,"Paolo was very friendly and gave us loads of tips on things to do in the area and which places to visit (location is perfect). He took his time to welcome us and we felt very much at home in his place. At checkout he let us leave our bags to pick up later. Overall we had a great stay!"
24452824,"Nice room in a super-central, great apartment",8,Kakhaberi,"The place is clean and nice. It is located 10 min walking distance to underground station and near the supermarket. Convinient place to stay in Berlin! Thanks Paolo for your hospitality!"
24452824,"Nice room in a super-central, great apartment",8,Cristóbal,"Paolo was an extraordinary host. The neighborhood is cool and the room was perfect for my needs."
24452824,"Nice room in a super-central, great apartment",8,Sophie,"We had a great time staying here - the room and apartment were lovely and in a good location. Paolo was really friendly and helpful, couldn’t have asked for better!"
24452824,"Nice room in a super-central, great apartment",8,Nathalie,"L'appartement de Paolo est idéalement situé. Il est grand et bien équipé. Paolo est toujours disponible et sensible à ce que nous passions un bon séjour. Mon vol a été annulé, et la chambre n'était plus disponible, mais Paolo s'est inquiété de nous et nous a permis de laisser nos bagages pour profiter de la journée supplémentaire que nous avions. Merci beaucoup!"
24452824,"Nice room in a super-central, great apartment",8,Marina,"Nos alojamos mi pareja y yo en un cuarto junto al salón muy cómodo y con privacidad. A apenas 15 minutos de la puerta de Bradenburgo en bici.  Paolo te ayuda en todo lo que necesites, muy agradable. Los 5 días allí han sido estupendos! Muchas gracias por todo!"
24452824,"Nice room in a super-central, great apartment",8,Amina,"Paolo was a great host on my recent trip to Berlin. The apartment is in a great location, under 5 minutes walk from Checkpoint Charlie, the local public transport station and supermarkets. Paolo provides everything you may need for your stay and has lots of suggestions for places to visit and local tips."
24452824,"Nice room in a super-central, great apartment",8,Scott,"Convenience and kindness from a very pleasant host"
24452824,"Nice room in a super-central, great apartment",8,Emil,"Paolo is a great guy and fantastic host. The flat is a very friendly environment and I had many nice interactions with the other guests.

The location is good. Tons of nice places to eat at not far away.

Much recommended!"
24452824,"Nice room in a super-central, great apartment",8,Claire,"This apartment worked super well for my short stay in Berlin. It is very well situated to see things like Checkpoint Charlie, and is a short bus ride away from other museums and tourist attractions. Paolo was a wonderfully accommodating host, and made the check in process easy and painless. His website that gives instructions on how to get around is a great added touch!
"
24452824,"Nice room in a super-central, great apartment",8,Josh,"Paolo was really considerate, thoughtful, and gave us some great local tips and recommendations! Plus, the apartment is in a great area - a short walk from almost everything!"
24452824,"Nice room in a super-central, great apartment",8,Manuel,"Todo muy bien,por sacar una critica constructiva diríamos que la cama podría ser mejor,aún así con lo cansados que llegábamos descansabamos bien.Un saludo para Paolo que fue muy atento con nosotros."
24452824,"Nice room in a super-central, great apartment",8,Jessica,"Paolo's place is absolutely fantastic.
First of all, the check in time was flexible so it was not a problem that we arrived on a late flight in the evening. Paolo has created a web page with all the frequently asked questions, including how to get there from different places, so it was very easy for us to find the place from the airport. He was also very quick to respond to our messages.
The room is a good size and the bed is comfortable. The kitchen and living space is open so it is a nice place to chill out. Also there are two bathrooms with good showers. There are also plants in the house which is nice and everything is really clean. The location is also great.
Paolo is a great host. He is able to give you tips and advice on what to do in Berlin, and is interesting to talk to as well. 
We had a great time here and we were sad to leave. If you book this place, you won't be disappointed."
24452824,"Nice room in a super-central, great apartment",8,Dave,"Great place, great host. I was only in Berlin for one night and Paolo gave me the correct information to see as much as possible for my short time there. Very friendly host and a really great place to stay, especially if you want to be close to everything!"
24452824,"Nice room in a super-central, great apartment",8,Álvaro,"Paolo & Hanna are lovely, their house is beautiful and the neighborhood is central, quiet and beautiful."
24452824,"Nice room in a super-central, great apartment",8,Subhashree,"It was the perfect place for us. He respected our privacy yet he was helpful and always available to help in any manner. We enjoyed our stay at his place."
24452824,"Nice room in a super-central, great apartment",8,Anatole,"Sehr sympathische Kommunikation
Top Lage und alles ist entspannt"
24452824,"Nice room in a super-central, great apartment",8,H,"Cannot say enough good things about Paolo and his gf. Place is spacious and stylish and Paolo really makes you feel at home. Lots of local tips, close to the bus stop and walking distance to checkpoint Charlie. Recommended 100%"
24452824,"Nice room in a super-central, great apartment",8,Paweł,"Paolo was a very friendly and helpful host. The flat is cosy,  clean and  well-equiped,  location is great for newcomers, about 10 minutes away from u-bahn."
24452824,"Nice room in a super-central, great apartment",8,Timothy,"Wonderful access to Berlin sites. The flat had absolutely everything you could need to make your time enjoyable and the host is very helpful."
24452824,"Nice room in a super-central, great apartment",8,Claire,"L'accueil de Paolo était parfait, il a été chaleureux et avait à cœur de mettre à notre disposition ce dont nous avions besoin. L'appartement est moderne et très bien situé, nous avons pu nous déplacer sans aucun problème et beaucoup de choses intéressantes sont accessibles à pied ! Le seul bémol était le matelas trop mou pour nous et qui aurait pu vraiment devenir gênant si nous étions restées plus d'une semaine, mais globalement l'accueil et l'hébergement étaient d'excellente qualité ! Merci Paolo"
24452824,"Nice room in a super-central, great apartment",8,Antonio,"Paolo and Hannah are great both as people and as hosts: they are nice and make you feel confortable and help you to know the city. The apartment is beautiful, perfectly clean and in a perfect location. Thank you very much!"
24452824,"Nice room in a super-central, great apartment",8,Emelie,"A really clean and large apartment well situated among the tourist attractions and restaurant areas of Berlin. Paolo was very friendly, responded quickly to our messages and gave great recommendations of the tourist attractions in Berlin. My boyfriend and I are very pleasd with our stay!"
24452824,"Nice room in a super-central, great apartment",8,Furkan,Super!
16298466,"Comfy room in a super-central, great apartment",8,Xavier,"Great place, super easy and flexible checkin. Highly recommended."
16298466,"Comfy room in a super-central, great apartment",8,Victoria,"Paolo’s apartment is incredibly central & has everything you might need & more, including basic food/beer which was unexpected and so appreciated. He had lots of tips for nightlife & where to eat/go out, and overall he made our first trip in Berlin so much more enjoyable."
16298466,"Comfy room in a super-central, great apartment",8,Grégory,"Paolo is a great guest. Very friendly and warmful. His place is really close to the metropolitan. You would love it to discover Berlin. Nice bathroom, big kitchen with coffee, good bed and sofa, the room has even a balcony. A very good place to stay in Berlin . Thanks Paolo !"
16298466,"Comfy room in a super-central, great apartment",8,Benjamin,"Paolo was very helpful and the place is great!"
16298466,"Comfy room in a super-central, great apartment",8,Piotr,"Paolo is one of the best hosts I ever had! Even if I only stayed for a day, he was super kind, open and welcoming. I highly recommend his apartment. It is big, clean, tidy and cozy. Very good location too!"
16298466,"Comfy room in a super-central, great apartment",8,Andrew,"Paolo is an excellent host. Super responsive and I felt like I was home. I look forward to coming again."
16298466,"Comfy room in a super-central, great apartment",8,Marieta,"We totally enjoyed our stay. Paolo and all the other people that we met during our stay were such a nice people. Also he allowed us to leave our bags a bit early than our check in which was good because we had the chance to enjoy the city :) I think that we make new friends in Berlin. Cheers!"
16298466,"Comfy room in a super-central, great apartment",8,Mike,"Paola was a great, friendly and very helpful host. Provided everything needed for our stay in Berlin. Would recommend to anyone looking for a good value central place to stay which is clean, tidy and has great facilities (real nice shower and even a projector)"
16298466,"Comfy room in a super-central, great apartment",8,Axel,"Paolo and Hanna were very friendly and accommodating, happy to bring forward the check in time at my request . The flat is in a block some 5-7 mins from the Kochstrasse Ubahn, and the room I stayed in had a nice large window with a view over the neighbourhood. There is a späti en route from the station for beer and snacks and plenty of cafes and reasonable restaurants nearby."
16298466,"Comfy room in a super-central, great apartment",8,Kristian,"Paolo is a great, very responsive host. 
The place is comfortable and very well located. We walked or biked to pretty much everywhere from that spot. 
Hope to be back soon."
16298466,"Comfy room in a super-central, great apartment",8,Luke,"Great central location and welcoming hosts. I would highly recommend staying at Paolo's!"
16298466,"Comfy room in a super-central, great apartment",8,Kelvin,"Paolo's place is centrally located, and I had a great time in Berlin! :)"
16298466,"Comfy room in a super-central, great apartment",8,Josh,"Great location. Paolo was very welcoming. Kind and helpful. Spacious room and bed. Good hospitality. Would recommend!"
16298466,"Comfy room in a super-central, great apartment",8,Harneet,"Good location, lovely hosts and a clean, no-fuss apartment. The bed in our room could be a bit small for 2 people if you are sharing but the space on offer is pretty decent. Pro tip: don't refuse if Paolo offers your watermelons and/or cherries :)"
16298466,"Comfy room in a super-central, great apartment",8,Alexey,"Paolo is a great host, very friendly and welcoming, I wish I had more time to get to know him! The room is cozy and ideal for two people, and the location is simply perfect! Would recommend everyone to stay at Paolo's apartment!"
16298466,"Comfy room in a super-central, great apartment",8,Hilde,"It was great. The appartment was big, clean en well located. I recommend it."
16298466,"Comfy room in a super-central, great apartment",8,"Jon & Fiona","A great place to explore Berlin from. The bedroom and bathroom were generously sized. This meant we could relax in private or socialise with the host and other guests in the living area. The apartment was neat and uncluttered. We would highly recommend for people on holidays or business trips."
16298466,"Comfy room in a super-central, great apartment",8,Nasir,"Paolo is responsive, flexible and helpful. The apartment is clean, easy to access, and at a great location."
16298466,"Comfy room in a super-central, great apartment",8,Lisie,"Paulo is truly a super host. He is organized and professional and treats his guest with care. The bed was comfortable, the bathrooms and kitchen were always clean. It was a pleasure to stay at his place. I would highly recommend to anyone staying in Berlin."
16298466,"Comfy room in a super-central, great apartment",8,Edric,"I highly reccomend this central place in Berlin. Paolo, the host, is an awesome guy! Supplied us with a lot of information about the place and also took care of us during our stay. The place is very cosy and it is all you need if you're staying in Berlin!"
16298466,"Comfy room in a super-central, great apartment",8,Lei,"Alles in Ordnung, super Lage."
16298466,"Comfy room in a super-central, great apartment",8,Gentry,"Great location, great people, and great space. It felt cozy and close to Mitte."
16298466,"Comfy room in a super-central, great apartment",8,Bas,"Paolo is a great host, he has great tips and a nice an easy going person. The appartment is nice and clean and the location is absolutely perfect! Next time we will certainly try to stay here again!"
16298466,"Comfy room in a super-central, great apartment",8,Federica,"Comoda sia per raggiungere il centro che la zona East side, ben collegata e tranquilla.  Autobus vicino casa e metro anche. Paolo è una persona gradevole e sa mettere a proprio agio. Disponibile a dare consigli su cose da vedere alternative e non troppo comuni e scontate."
16298466,"Comfy room in a super-central, great apartment",8,Kellerman,"Зис ис вери гуд хост энд флэт! Риали!"
16298466,"Comfy room in a super-central, great apartment",8,Inci,"Paolo was friendly and helpful. His place is close to the bus station and the metropolitan. The place is very nice, clean and comfortable  if you looking accomondation for  Berlin. It's in here. 
Thanks Paolo.."
16298466,"Comfy room in a super-central, great apartment",8,성묵,"새로운 설레임과 두근거림을 위한 최고의 여행장소 입니다. 이러한 공유형 숙박시스템에 두려움이 있었지만 이 집으로 극복할 수 있었습니다. 처음에 독일에서 어려웠던 대중교통 시스템이나 주변에 볼거리 그리고 음식 추천까지 호스트분께서 너무 친절하게 알려 주셨고, 매일 밤마다 서툴렀지만 영어로 너무 멋지고 훌륭한 대화를 했던것 같습니다. 많은 외국 친구들을 만들었고 다들 너무 매너가 좋아서 지내는 내내 행복했습니다. 위치나 위생상태도 정말 편하고 좋았습니다. 추천!"
16298466,"Comfy room in a super-central, great apartment",8,Conor,"The location accommodates 3 people much nicer than we expected. It was  very comfy had everything we need and Paolo was a super accommodating host! 
Great place, great location and we had a great time!"
16298466,"Comfy room in a super-central, great apartment",8,Ivan,"Perfect location, nice flat. Paolo is very helpfull, communication was superb."
16298466,"Comfy room in a super-central, great apartment",8,Madi,"We absolutely loved this place! The host is really friendly and made you feel really comfortable! It’s in a great location and super close to the train station. Perfect place for an easy stay in Berlin! "
16298466,"Comfy room in a super-central, great apartment",8,Masahiro,"It was a good place to stay we reaply enjoyed Berlin  Thank you Paolo"
16298466,"Comfy room in a super-central, great apartment",8,Alex,"The host, Paolo, was super friendly, helpful and recommended a lot of great restaurants and activities. The location was great, everything we wanted to see in Berlin was in walking distance. The room was comfy and quiet. We really enjoyed our stay."
16298466,"Comfy room in a super-central, great apartment",8,Monica,"Paolo's place was perfect for our stay in Berlin. It was central to everything we wanted to do and very comfortable. Paolo was also incredibly welcoming!"
16298466,"Comfy room in a super-central, great apartment",8,Mark,"Paulo made our visit a fantastic one with his great communication, cleanliness, and overall friendliness. He was also very helpful when I asked for advice of what I should visit around the city.  He is a great host and I feel like Ive made a friend amongst my Germany trip. I highly suggest place. :)"
16298466,"Comfy room in a super-central, great apartment",8,Antoine,"We had a great stay at Paolo's ! The apartment is nice, clean, and very well situated in Berlin. Paolo is a super host, providing good advice to whom wants to discover the city !

Super séjour chez Paolo ! L'appartement est sympa, propre, et très bien situé dans Berlin. Paolo est un super hôte, donnant de bon conseils à qui cherche à découvrir la ville !"
16298466,"Comfy room in a super-central, great apartment",8,Frida,"All I can say is Paolo is truly a very friendly and helpful host :)"
16298466,"Comfy room in a super-central, great apartment",8,Alex,"Great host! The place is in a central location. He accommodated my checkin even though I was a bit disorganized. He knows quite a lot about the city and has good recommendations. The place was clean and tidy. I would happily stay here again."
16298466,"Comfy room in a super-central, great apartment",8,Omer,"Paulo's place was very comfortable, spacious and clean. The apartment is very well located, a walking distance from most places and very close to a train station. Paulo was very helpful before and during our stay there. Helped us with great tips and recommendations. 
A great place and a great host, 100% recommended!"
16298466,"Comfy room in a super-central, great apartment",8,Brooke,"Great location and Paolo had very handy tips"
16298466,"Comfy room in a super-central, great apartment",8,Simon,"Wow! :) We had an amazing stay at Paolo‘s place! Thank you so much!
The location is really, really beautiful, amazingly located in the center of Berlin,
For me it was the best Air Bnb Stay ever, and will definitely come back stay at Paolo’s Place when i am in Berlin. 
Everything was perfekt. Paolo is a great guy, very open and welcoming, so its the perfect environment for every guest, to relax & enjoy the stay in Berlin, fully. I will recommend your apartment further =) 

Best Wishes! =) Simon "
16298466,"Comfy room in a super-central, great apartment",8,Luke,"This was my first time using airbnb so I was a little anxious, but Paolo is a flexible, friendly and fantastic host. My brother and I stayed in Berlin for 3 nights and it was perfect to have a nice, clean and quiet place to rest and sleep after a tiring day. Paolo was super helpful, especially with pointing out some niche places to visit or eat. The highlight, however is definitely the location. If I could rate 10/5 stars I would, as the area is very, very close to Checkpoint Charlie, and is therefore also very close to the U-bahn (Metro). Any location in Berlin is literally a 2 min walk and train ride away; which means quick travel to the sights, the opportunity to rest up easily at any time by popping back to the apartment, and the mercy of a short trip back to the place to sleep at the end of the day when you are tired.
The perfect base from which to explore the city."
2161434,"Nice room in the heart of Berlin!",8,Diamond,"This is perfect for anyone looking to stay conveniently in Berlin.  Very friendly environment, close to everything and with your own room your privacy is respected.  Also very secure and safe."
265433,"Spacious 6-bed-room in Berlin ",9,Sven,"Alles voll okay."
265433,"Spacious 6-bed-room in Berlin ",9,Iris,"Everyone who works there was awesome, really welcoming and helpful. "
265433,"Spacious 6-bed-room in Berlin ",9,Silvio,"Great place. Clean. Staff friendly. Although they need to sort the internet connection out. Overall, good staying. I would definitely go back."
265433,"Spacious 6-bed-room in Berlin ",9,Jérémy,"The room was clean and people were very nice. Moreover, this hostel is very well located !"
265433,"Spacious 6-bed-room in Berlin ",9,Takayuki,"Staff were doing great jobs"
265433,"Spacious 6-bed-room in Berlin ",9,Gabriel,"As an hostel it was awesome! everything was clean, they gave me a map of the city that was really useful! the guys in the reception are friendly and open mind! really nice staying! :D"
265433,"Spacious 6-bed-room in Berlin ",9,Danny,"This hostel has a really loose and funky vibe that I enjoyed. Friendly staff, comfortable beds, 24hr reception (Berghain is up the block). The breakfast was only €3 and a better deal than other hostels I've stayed at. Only real complaint is that the kitchen they provided on my floor had kitchenware that was well beyond its prime... The only pan had all of the Teflon scratched off. They did have 2 fridges and a cook top though. Sunflower hostel was a good into to Berlin for me. I would recommend it."
265433,"Spacious 6-bed-room in Berlin ",9,Roman,"Ich habe mich sehr wohl gefühlt und werde sicher wieder kommen. Für den kurzen, günstigen Trip nach Berlin ideal, wenn man keinen Luxus braucht und ein offener Charakter ist."
265433,"Spacious 6-bed-room in Berlin ",9,Marsha,"Sunflower Hostel was perfect, all facilities were clean, comfortable and spacious. Staff was friendly during our welcome, provided with bed sheets and towels. The lounge area was also a great place to relax after a long day, plus they serve refreshing and affordable beers at their bar.
Location was convenient 10 min walk to Warschauer Strasse S and U Bahn and 15 min walk to East Side Gallery. The neighbourhood is very active, especially at night there's still food stalls running late and clubs around the area. 
Would definitely recommend this place and no doubt im staying here again if i come again to Berlin!"
265433,"Spacious 6-bed-room in Berlin ",9,Ariadna,"Although its a nice place, clean and really near from East Side Gallery. I prefer the common airbnb houses. "
265433,"Spacious 6-bed-room in Berlin ",9,Gary,"Good location, friendly staff, good facilities & great breakfast for €3. Normal Airbnb properties provide a room etc. normal hostels you take pot luck with who you bunk with& comings/goings. Although I thought Sunflower was overall good I would prefer to book at a normal Airbnb place."
265433,"Spacious 6-bed-room in Berlin ",9,David,"All was alright"
265433,"Spacious 6-bed-room in Berlin ",9,Kolter,"I had a pleasant stay at this hostel. It was located a ways from the main area of Berlin which was nice, it was only a 5 min train into Alexanderplatz from the nearby station. The area it was located seemed to come alive at night. The rooms were clean and the staff were accommodating. The atmosphere was nice as well."
265433,"Spacious 6-bed-room in Berlin ",9,Malte,"Alles super "
265433,"Spacious 6-bed-room in Berlin ",9,Jae,"the location is very nice, but the reception is a bit on the aggressive side when they talk because they're so busy a lot of the time. The bathroom situation was a bit inconvenient because there was only one boys bathroom on the floor that I was on because of construction and that bathroom had water all over the floor. The beds themselves were comfortable and the curtains on the beds were nice."
265433,"Spacious 6-bed-room in Berlin ",9,Raymond,"I didnt really like this place! We had a good welcome, but this hostal doesnt have a personal vibe. Also the music in the lobby is terrible, it sounds like they really want you to get away fast from that place. Shower is also really sad, when you wake up a bit to late, you will have a cold shower. Also the whole crew Working there didnt really want to do much.  The only good thing about this hostal is that it is really close to the berghain. :)"
265433,"Spacious 6-bed-room in Berlin ",9,Dirk,"Das Sunflower Hostel ist ein Hostel wie es im Buche steht. Voller Leben und spannender Persönlichkeiten. Die Duschen und Toiletten sind sehr sauber und man fühlt sich in den Zimmern wohl. Ein idealer Ausgangspunkt um das Berliner Leben kennenzulernen."
265433,"Spacious 6-bed-room in Berlin ",9,Izzul,"The place is near to the city which is good and the hostel also was very comfortable too. The staff is really helpful and friendly. "
265433,"Spacious 6-bed-room in Berlin ",9,Linus,"Richtig Nice!"
265433,"Spacious 6-bed-room in Berlin ",9,Paulina,"Great place to meet people! Do take their alternative walking tour! Their location is perfect esp if you want to go club hopping. Loved their 3€ breakfast. the staff are great and super helpful. Very accommodating 
Highly recommend!!!"
265433,"Spacious 6-bed-room in Berlin ",9,Sergio,"Buen precio con respecto a la ubicación"
265433,"Spacious 6-bed-room in Berlin ",9,Marvin,Super!
265433,"Spacious 6-bed-room in Berlin ",9,Loïc,"nice place to stay! good location"
265433,"Spacious 6-bed-room in Berlin ",9,Gamal,"Everything was super! Nice people at the Sunflower Hostel. We got in touch with so many new people there. Sometimes there are parties in the foyer. Really great."
265433,"Spacious 6-bed-room in Berlin ",9,Tabea-Alena,"It's nice"
3108686,"Nice and big 8-bed-room in Berlin",9,Alex,"Впечатление от поездки испортил парень на ресепшене, который в обход правил потребовал с нас дополнительную плату за постельное белье. Не выношу обман. Данный депозит был возвращен частично.
Кровати скрипят, рядом железнодорожное депо, райончик напоминает гетто, нельзя самому приготовить еду, холодильника в свободном доступе нет. "
3108686,"Nice and big 8-bed-room in Berlin",9,Javier,"I dont understand why they kick u out at 11 when check in is at 15:00 if you have to do the bed yourself... Besides that good place to stay."
3108686,"Nice and big 8-bed-room in Berlin",9,Sina,"Der Aufenthalt im Sunflower Hostel war super!
Das Zimmer ist einfach eingerichtet und hat alles was man braucht. Wir benutzten die Küche sehr oft und lernten während unserem Aufenthalt im Hostel viele tolle Menschen kennen. Das Hostel ist sehr zentral gelegen. Um zum Alexanderplatz zu kommen hat man nur c.a 7 Minuten. Die Gastgeber waren sehr freundlich und offen. Man fühlt sich im Sunflower Hostel wie in einer WG. Ich werde auf jeden Fall wieder dort buchen! :)"
3108686,"Nice and big 8-bed-room in Berlin",9,Ricardo,"Buen servicio"
3108686,"Nice and big 8-bed-room in Berlin",9,Jeanne,"Une auberge de jeunesse bien située si l'on souhaite découvrir les clubs et le quartier de kreuzberg. L'équipes vous propose des services intéressant a savoir petit dej pas cher, cyber, et bar 24/24. L' acceuil est correct mais les petites surprises pécuniéres font un peu grincer des dents, taxes de séjours, caution pour les draps, serviettes et cadenas. Niveau propreté il y a de la marge de progréssion, le check-out est plutôt matinal! Je garde tout de même un bon souvenir de l'ambiance routs qui y règne."
3108686,"Nice and big 8-bed-room in Berlin",9,Kim,"Alles gut. Danke."
3108686,"Nice and big 8-bed-room in Berlin",9,Ko,"Good vibes from the very beginning!
I arrived, as many travelers do, hungry, weary, a bit intimidated by this strange and intense city. The staff was warm and the space was welcoming, which I found to be a great comfort as it was my first time in Berlin and I was traveling alone!
Super cool neighborhood, too! Inexpensive Turkish food, cheap beer!
The building was quite clean, and well-kept! And a 3 Euro all-you-can-eat breakfast!
I'm definitely going to stay there again next time I'm in Berlin!"
3108686,"Nice and big 8-bed-room in Berlin",9,Marine,"Les chambres sont très spacieuses très propres, les lits confortables, les salles de bains et toilettes facilement accessibles. Tout est très propre, et l'auberge est très conviviale! Rien à redire, c'était parfait!"
3108686,"Nice and big 8-bed-room in Berlin",9,Jelena,"People - welcoming, helpful, providing all the information you need. Accommodation - comfortable and clean. Directions to the hostel - accurate and clear, completely useful for finding the hostel location. Very nice experience, would definitely repeat it when being again in Berlin. "
3108686,"Nice and big 8-bed-room in Berlin",9,晓娴,"this is an amazing hotel ,cheap with very nice people in reception( a guy and a girl work in reception i meet is really nice).
And i also meet some interesting friends and go to a bar that is very cool nearby,have a lot of fun.

Suggestion is that:as i live in fourth floor i cant get enough hot water at night but anyway i can go to first floor,just a suggestion if there are hot water in my floor would be great.   and another suggestion is maybe you can put some Fragrances in bedroom so that we  wont have bad smell when the room is full:))"
3108686,"Nice and big 8-bed-room in Berlin",9,Julıa,"Alles super "
3108686,"Nice and big 8-bed-room in Berlin",9,Mao,"Excelent people, staff and ambient! Very recommended"
3108686,"Nice and big 8-bed-room in Berlin",9,Ari,"Nice clean place, felt comfortable leaving my stuff unlocked. Didn't sleep well because of all the people in the room coming in at various times making noise and talking. Wouldn't have been a problem if I wasn't there for an internship and had to get up early!"
3108686,"Nice and big 8-bed-room in Berlin",9,Steve,"Great location, clean, safe with a very friendly staff you could not find a better place to stay in this part of Berlin."
3108686,"Nice and big 8-bed-room in Berlin",9,Levente,"Best place to stay. The public transportation is close, you can have a breakfast in the bar. I was pleased with the service too! Recommended!"
3108686,"Nice and big 8-bed-room in Berlin",9,Rachel,"We had a good stay at the Sunflower Hostel. It was kept clean. It is not too far of a walk from the train station. The staff is very nice!"
3108686,"Nice and big 8-bed-room in Berlin",9,Ricardo,"Buena ubicación, súper fácil tomar transporte público o rentar bicicleta para moverse por Berlin, la cual es una buena opción. El desayuno es delicioso y en precio justo."
3108686,"Nice and big 8-bed-room in Berlin",9,Daniel,"It was cool but for a family I think is not suitable. The  staff was not very kind, they were all the time like rushing and did not pay enough attention to our questions, the toillets were not very clean. About the price, it is ok but it is better to go if you are alone or with friends but not with your parents. "
265408,"Elegant 4-bed room in Berlin",9,Hannah,"I was recommended this hostel by a friend and I understand why now! So rare to find a hostel vibe these days but you will find it here! Definitely due to the staff. We had a 4 bed room and it was so nice. Won't think twice about where to stay on my next trip to Berlin! "
265408,"Elegant 4-bed room in Berlin",9,"Sylvia J.","Ich kann bestätigen, dass der Service im Sunflower Hostel ausgezeichnet ist - immer freundlich, vielsprachig. Unser Zimmer war sauber, die Dusch- und Toilettenräume auch. Das Internet funktionierte nicht immer mit meinem iPad, aber ich konnte mich über die PCs im Hostel einloggen."
265408,"Elegant 4-bed room in Berlin",9,Nestor,"It's just a hostel, as any other hostel, nothing special. The rooms were clean, there's plenty of toilets and showers for everyone, and the lobby is nice. As almost any hostel, you have to leave deposit, but they hand it back to you on checkout. The only thing I didn't like, is the key policy, because there's just one key for the room. "
265408,"Elegant 4-bed room in Berlin",9,Eddy,"The hostel is in a great location and right next to a world famous club. The personel is nice and friendly and the rooms are in a pretty good condidition. I would definetly recommend this to my friends."
265408,"Elegant 4-bed room in Berlin",9,Paweł,"Everything just fine. I recommed this hostel!"
3108596,"Spacious 6-bed room in Berlin",9,미나,"진짜 여기 짱짱!!!! 1층에 바가 있는데 언제든지 내려와서 놀 수 있어요. 배를린 장벽이랑도 걸어서 15분 정도??? 코앞에 있음. 근데 1층에 바가 있어서 맨날 맥주 마실 수 있구 신나는 노래 나와서 좋긴 한데 밤엔 조금 시끄러울 수도 있어요. 조용한 곳 찾으신다면 별로...
시설 청결도 샤워룸 다 좋았어요. 아침은 3유로 주고 사야하는데( 한 번 만 내면 됨) 3유로 보다 훨씬 더 좋았어여. 에어 비앤비로 가면 버짓도 3유로받음"
3108596,"Spacious 6-bed room in Berlin",9,Will,"Sunflower hostel was great! Awesome location in East Berlin, nice facilities, and a very helpful staff. "
3108596,"Spacious 6-bed room in Berlin",9,Simon,"Alles bestens, angenehmer Kontakt, super Lage, gerne wieder!"
3108596,"Spacious 6-bed room in Berlin",9,Mark,"Nice hostel!"
3108596,"Spacious 6-bed room in Berlin",9,Marta,"Well situated hostel, easy to find and good overall. The only bad thing is that the bunkbeds are quite noisy, so be sure to have earplugs!"
3108596,"Spacious 6-bed room in Berlin",9,Lorena," Es un hostal muy cómodo. Buen servicio. Cerca de la estación para llegar de manera rápida al centro. Un buen lugar para compartir y conocer gente.  Zona de bar, servicio de lavadoras y computadores. 
El internet un poco lento pero de resto todo súper. "
3108596,"Spacious 6-bed room in Berlin",9,Paula,"the best hostel i been in europe. amazinggg"
3108596,"Spacious 6-bed room in Berlin",9,Wilson,"The sunflower is in a great spot. Wonderful neighborhood and within walking distance of an S-Bahn stop and the Ostbahnhof. The room was great, with plenty of space and even a well-equipped kitchen. The downstairs bar was a great place to meet people, too. Only complaint was that the wifi was atrocious. For a hostel of this size I expected better. But nonetheless, it's a great place to stay in Berlin. I would stay again."
3108596,"Spacious 6-bed room in Berlin",9,Harry,"Great hostel in a perfect location. Thoroughly recommend"
3108596,"Spacious 6-bed room in Berlin",9,Emma,"Sunflower hostel is in a great location, right next to a main train station and close to some really cool cafes and suicide circus. The room was very clean, and so was the rest of the hostel, there was plenty of space and their reception was very kind and helpful!"
3108596,"Spacious 6-bed room in Berlin",9,Liam,"Our 3-day stay at the Sunflower Hostel was an extremely positive experience. It was our second time visiting Berlin and I think it is fair to say that we preferred this hostel to our previous one (St. Toby's Inn, I think it was called). 

The biggest advantage of the Sunflower Hostel is the location. Very central, about a 5 minute from the Warschauer Strasse station, we never needed to travel more than half an hour to anywhere we wanted to go. The East Side Gallery is walking distance, just past a selection of decent restaurants. 

The staff were welcoming and full of knowledge of the surrounding area. Every night the bartender recommended bars and clubs of all types. Suicide Circus was probably our favourite club of the trip, which is situated next to the train station. But if you don't like clubbing or want a quieter night to rest, the Hostel's bar is a fun place to meet people.  Our favourite bar in the area was Urban Spree, a nicely decorated outdoor bar in a slightly hidden lo"
3108596,"Spacious 6-bed room in Berlin",9,Andrea,"If you are alone, this is the best place to stay in Berlin.
 Really a great place!!"
3108596,"Spacious 6-bed room in Berlin",9,Nina,"L'hôtel étant très bien situé c'est l'idéal pour visiter Berlin, l'équipe est également très accueillante et n'hésite pas à vous aider. J'ai apprécié mon séjour."
3108596,"Spacious 6-bed room in Berlin",9,Danielle,"Prima plek voor kort verblijf in Berlijn."
3108596,"Spacious 6-bed room in Berlin",9,Ariane,"Great location, lots of action and activity around.  Nice staff and great atmosphere.  I really liked this hostel.  The sheets were clean and the bathrooms as well.  Would stay again if returning to Berlin!  Walking distance to the “wall”"
3108596,"Spacious 6-bed room in Berlin",9,Thierry,"Hotel agréable est bien situé pour découvrir Berlin"
3108596,"Spacious 6-bed room in Berlin",9,Kyriacos,"Room was clean, hosts were friendly and welcoming. Great area, very close to Berghain and public transport. Shared room was pricy but it was new year's eve. Would definitely stay again!"
3108596,"Spacious 6-bed room in Berlin",9,August,"All over a good experience! The only negative was the 5% tax, which we thought was included in the Airbnb price"
265416,"Colorful 6-bed-room in Berlin",9,Alexandra,"If you don't mind feeling like you are at camp, this place is fine for you. Not the best location but near the metro to get around. I have stayed at other hostels in berlin so much better for the same price and better location(heart of gold hostel) and would recommend staying there instead with better location anyway. I stayed here because it was the only hostel during the new year that was available but I would not recommend it nor would I stay here again. The bathrooms were not clean-ever, the wifi barely worked and you can only get it in the reception area, the beds are flimsy and noisy, the key system is very unreliable (one key per room and the last person out has to drop it off at the desk-basically anyone can walk in and out of the room), the area is very sketchy and I didn't feel safe at all. "
265416,"Colorful 6-bed-room in Berlin",9,Anastasia,"very well organized and charming place. Very clean as well. "
265416,"Colorful 6-bed-room in Berlin",9,Daniel,"It was Easter holiday in Berlin and all guest houses where fully booked. Luckily I fount sunflower hostel! Bed was clean and breakfast was served for reasonable 3 euro price. My three days there were comfortable and easy going. I Met a few more travelers around town and had a good time. Thank you sunflower hostel!"
265416,"Colorful 6-bed-room in Berlin",9,Marco,"Personale giovane sempre disponibili !
Le camere pulite e i servizi impeccabili !
Consiglio per chi vuole soggiornare a Berlino in maniera cheap in un quartiere molto carino .
tra l'altro anche a due passi dal panorama Bar !

All the best"
265416,"Colorful 6-bed-room in Berlin",9,Davide,"Nice place, friendly staff, clean.
Located at 5 minutes walking distance from Warschauer Strasse S-bahn station (great starting point to reach almost every spot in Berlin)
Free wifi in the reception for guests.
When I was there work in progress in the street made some noise  in the morning, not too annoying for me anyway.
A lot of teenagers, but that's what you should expect from a hostel.
I would stay there again.
"
265416,"Colorful 6-bed-room in Berlin",9,Katherine,"Perfect neighbourhood, friendly staff. Wifi in the rooms could have been a lil better, and the pics aren't too accurate, but if you need a sweet wee hostel to crash for a little while it's perfect :)"
265416,"Colorful 6-bed-room in Berlin",9,Emma,"Good location close to a train station stop, friendly staff and clean rooms and building in general, good amenities."
265416,"Colorful 6-bed-room in Berlin",9,Johannes,"If you want to go party in Berlin, this hostel is perfectly located !!! Nice staff and clean rooms!"
265416,"Colorful 6-bed-room in Berlin",9,Malvika,"Place is much more beautiful than what it appears on the net..the rooms are fresh, clean n cosy. The hosts are very warm n helping except a dry haired guy in the morning on the main desk..the women hosts were specially friendly and warm! Clean sheets n towels need a separate deposit but totally refundable.. Approach to the hostel is little shady fr first timers but dont get scared..place is awesome! Their cafe area has great wifi n lovely ambience. Supermarket aldi is right next door n its 5-7 walk till nearest S-Bahn station..wauchauser strabe..something like that..check in n out times are little off the beat but do book if they suit you..good experience overall!"
265416,"Colorful 6-bed-room in Berlin",9,Emma,"its a very nice choice! its clean and u get to meet people from all over the world!!"
265416,"Colorful 6-bed-room in Berlin",9,Anthony,"Nice, cheap hostel with super-friendly, super-helpful staff.  Good location and just 5 minutes or so from S-bahn, U-bahn"
265416,"Colorful 6-bed-room in Berlin",9,Antoine,"I stayed there for a week. The staff was nice, the rooms large and the bathrooms clean. For this price, it was really good! And it's close to 2 stations. The neighbourhood is a bit weird but nothing scary, just different."
265416,"Colorful 6-bed-room in Berlin",9,Lele,"This is a very nice hostel, the shared bathroom at the ground floor is a luxory toilet/bathroom! not just a "hostel one" (i think that the pics are old, or maybe relatives of others floor), and this is great. just one thing: the shared bathroom are not so many..i suggets to put one/two more..but wow, what a shower! :) it was perfect after the crazy nightlife of berlin. The guys at the reception are very friendly, u can have a beer in the lounge where there is a wireless for free. The real nightlife of berlin is near, just walking distance. The street of the hostel is a bit isoleted, no bar and club in this street..but, if you do 5/10 minutes walking everything is different. i suggest it! the bed are confortable. enjoy sunflower!"
265416,"Colorful 6-bed-room in Berlin",9,Fil,"Sunflower hostel is a nice place with friendly hosts located only a 15 min food-walk to the O2 Arena. The hostel's atmosphere is artistically. The foyer/bar area features an awesome wall-painting delivering an instant feel-good vibe!!! The bed & the breakfast were good feat. a rock-solid coffee, a good-tasting, little fruit selection + the typical German crunchy-rolls with a small cheese & meat selection. You can have cereals as well. Tea-lovers will find an array of the most popular sorts.

The surrounding block Friedrichshain seems to be a pretty cool, cosmopolitan, friendly and overall-nice location. The vibe is artistical in anyway with amazing architecture, interesting street musicians and great Graffitis.

Sunflower hostel provides a good stay for a low budget."
265416,"Colorful 6-bed-room in Berlin",9,Vinka,"not so good for that price, batrooms werent clean, stuff wasn't very polite"
265416,"Colorful 6-bed-room in Berlin",9,Ayman,"It was clean and cheap. I'm satisfied."
265416,"Colorful 6-bed-room in Berlin",9,Zvonimir,"Hostel war ganz ok für die Lage hätt's aber auch günstiger sein können."
265416,"Colorful 6-bed-room in Berlin",9,Sebastian,"Völlig in Ordnung, coole Location, nette Leute, sauberes Zimmer. Leider nur kaltes Wasser beim Duschen."
265416,"Colorful 6-bed-room in Berlin",9,Alice,"Super auberge, très bien placée près des endroits où sortir. 
Chouette chambre et douches. Cool ambiance dans les communs. 
Je recommande vivement."
265416,"Colorful 6-bed-room in Berlin",9,Carole,"Bon séjour au sein de cette auberge propre et fonctionnelle. Le petit déjeuner est copieux pour 3euros par personne.
Un seul bémol cependant il n'y a pas de wifi et l'utilisation d'internet est payant, à notre époque je trouve cela dommage. Surtout lorsqu'on est en vacances pour consulter site touristique ou autre.
"
265416,"Colorful 6-bed-room in Berlin",9,Mette,"Det var en rigtig god oplevelse at sove på Sunflower Hostel. Vi sov på to forskellige værelse, fordi vi bookede en ekstra dag. Begge værelser var gode. Der var rent alle steder. Personalet var venlige og hjælpsomme."
265416,"Colorful 6-bed-room in Berlin",9,Chloé,"Super séjour, et super logement !
L'ambiance est vraiment détendue, il y'a une vraie diversité culturelle, on peut facilement faire des rencontres!
Les gens sont souriants, l'hôtel est sympa et accueillant, les chambres sont simples avec une déco originale!
Si vous voulez rencontrez des gens et plongez au coeur du quartier étudiant de Berlin, je vous recommande vivement cet hotel!"
265416,"Colorful 6-bed-room in Berlin",9,Marie,"Clean, quirky little hostel with nice staff and good breakfast. Would recommend!"
265416,"Colorful 6-bed-room in Berlin",9,Audrey,"I had an overall pleasant experience at the Sunflower Hostel, all this despite not being a hostel kind of person. If you like hostels than this one is an AWESOME location and you should definitely consider staying here.

On the plus side: 
The staff is friendly and accommodating
Beds are clean, sheets are freshly washed and pressed for all new tenants, towel included.
The hostel is very well located
The bar downstairs is a great way to meet new people and relax after a long day of wandering the streets of Berlin

On the not so hot side:
The wifi is only accessible from the lobby/bar, and is very slow.
The beds are a tad noisy and the lockers rattle like a freight train when someone walks by.

As Berlin has a thriving nightlife, people come and go at all hours. So even when they make best efforts to be respectful when they come in at unseemly hours, the whole room is bound to hear them come in (I was just as guilty of this as the other tenants). If you all have similar sched"
265416,"Colorful 6-bed-room in Berlin",9,Sonmez,"The location was near by the Berlin Gate and u can take a train where ever u want:)And there were a lot of cafes'restaurant and bars around the Hostel..People who were working there were like family and friendly.And u can make a new friend and u can hang out with them.I really recommend for staying there i loved Sun Flower Hostel>>
"
265416,"Colorful 6-bed-room in Berlin",9,Dávid,"Everything was OK."
265416,"Colorful 6-bed-room in Berlin",9,Julie,"Great hostel, nice people at the front desk, no issues. "
265416,"Colorful 6-bed-room in Berlin",9,Eira,"My stay at Sunflower Hostel was wonderful - the staff was always very nice and helpful, rooms were clean and quiet, and the place had a great atmosphere to it. Highly recommended! "
265416,"Colorful 6-bed-room in Berlin",9,瑞晏,"Really cool bar-like hostel and nice hosts, great furnishings and shower, with a kitchen. Within walking distance to the station, Berlin Wall east side and cool bars. The only downside is the wifi network is congested and hard to get in sometimes. There are computers you can use for 0.50€ for 40 minutes though."
265416,"Colorful 6-bed-room in Berlin",9,Farzan,"OMG this is such a hippie Hostel, I love it. Its amazing close to Warshauer StraBe Station on East side of Berlin with all cool graffitis bars and restaurants, There is also a super cool Vegan store close to the city.Its also very close (walking distance) to one of the best clubs in the world Berghain. Enjoy your stay xD"
265416,"Colorful 6-bed-room in Berlin",9,Mélodie,"Had a great time there during my stay! Clean enough, good location and nice staff. (Although it would be nice if each bed had its own bed light instead of just main light per dorm. )
All in all, a good hostel! I'll come back!"
265416,"Colorful 6-bed-room in Berlin",9,Scott,"An awesome location! Easy access to S bahn. Rooms very artsy and similar to pictures. Cool bar but small breakfast"
265416,"Colorful 6-bed-room in Berlin",9,Nicholas,"This was a great hostel. It was very clean and was a great place to hang out and meet new people. The wifi didn't work in the rooms but that was okay. There were large lock boxes under the beds. Just remember to bring a lock!  "
265416,"Colorful 6-bed-room in Berlin",9,Daniela,"Great stay! For the money value it was fine and also the staff was very helpful. The location was almost ventral and I was well connected to many places. Nice vegan supermarket on the corner of the street which was a plus. "
265416,"Colorful 6-bed-room in Berlin",9,"Sunny (Navte)","All perfect. Just an amazing place. Amazing staff :)"
265416,"Colorful 6-bed-room in Berlin",9,Scott,"I had a good time staying at the sunflower hostel. It was clean and the staff were friendly.
My hall had a kitchen, a dinner table, two bathrooms and two showers for 4 rooms of 6 people. Not all halls have kitchens. 
The 3 euro breakfast is excellent, if not as cheap as getting milk and cereal at Aldi's.
Not in the most convenient or nice area of Berlin, unless you like the spray can artist, then its great."
265416,"Colorful 6-bed-room in Berlin",9,Connie,"It was a good experience, the room was clean, the bathroom too. I liked the bar downstairs. All reception personnels were very kind and helpful.  "
265416,"Colorful 6-bed-room in Berlin",9,Alan,"Good hostel, very friendly and nice environment. "
265416,"Colorful 6-bed-room in Berlin",9,Ai,"Rooms were nice.  Staff is the best.  Met some really awesome people from everywhere."
265416,"Colorful 6-bed-room in Berlin",9,Baruch,"Cool little place very nice and chill spot "
265416,"Colorful 6-bed-room in Berlin",9,Louise,"Great place. Friendly staff. Good atmosphere. "
265416,"Colorful 6-bed-room in Berlin",9,Magda,"We spent nice time there, its perfect for the young people. The breakfest was good for this price. Hostel is very clean. The location is perfect. We fully recommended it.
"
265416,"Colorful 6-bed-room in Berlin",9,Deividas,"Nice place, perfect to meet people from all around the world. What I really loved that downstairs is bar and you can get also breakfast. Totally recommend! :)"
265416,"Colorful 6-bed-room in Berlin",9,Haneul,"We had a nice stay. We arrived quite late to the venue (3am) but we still could check in without any problems. The walk to the hostel is just a bit far if you have a lot of luggage with you, but it’s bearable.
Unfortunately we had to cover the bed by our own (linen were provided with a deposit) which was a bit difficult, as everyone was sleeping already and we were also really tired, so it would have been awesome if the beds were covered already. All in all, good price."
265416,"Colorful 6-bed-room in Berlin",9,Tobias,"Trevlig personal och prisvärt alternativ. Bra läge. Kunde varit något renare i rummen och toaletterna. "
265416,"Colorful 6-bed-room in Berlin",9,"Catharina Louisa","Sehr gemütliches Hostel in bester Lage. 
Wir hatten ein 6-Bett Zimmer gebucht. Was echt schön war, dass die Zimmer einen Balkon hatten. 
Badezimmer sowie WC's waren jeweils auf dem Gang und auch sehr sauber.
Morgens hätte man die Möglichkeit für 3€ ein Frühstück zu bekommen (die Auswahl war eher klein aber trotz allem war alles dabei was man brauchte) 
Das Sunflower Hostel würde ich auf jeden Fall wieder buchen."
265416,"Colorful 6-bed-room in Berlin",9,Chiara,"Loved the atmosphere that surrounds that place!"
265416,"Colorful 6-bed-room in Berlin",9,Sammy,"Practical and economical; recently renovated. Staff are kind and helpful!"
265416,"Colorful 6-bed-room in Berlin",9,Luka,"Hostel is very clean and nice place to stay, all staff is doing great job, friendly and organized. Thank you!"
265416,"Colorful 6-bed-room in Berlin",9,Antoine,"I had a very nice stay in the very clean hostel youth. The hosts are available and nice. I warmly recommend this place. "
265416,"Colorful 6-bed-room in Berlin",9,Madeline,"This was great hostel in a prime location. Close to transportation and things to do. Very clean with nice bathrooms. Fun people and friendly staff. Would stay here again!"
265416,"Colorful 6-bed-room in Berlin",9,嘉伟,"好吧,去之前根本不知道是家青年旅舍｡楼下有个小酒吧,我们去的那晚刚好有人在过生日,喝酒声,音乐声,吵闹声,一直持续到凌晨两点(我朋友说的,我早睡着了)｡
厕所和洗漱/澡是同一层住户共用的(共有两个,左右各一个)｡入租还要交钱(说是城市税,按房间价格算的)和被套,床单,毛巾的押金｡我们6个人,三个上下铺｡不提供洗漱用品和拖鞋｡如果是喜欢青年旅舍的人,应该还行,如果是要找宾馆酒店这种,特是30岁以上的,不太建议｡"
265416,"Colorful 6-bed-room in Berlin",9,Alejandro,"Satisfactory, nice service and really colorfull. I recommend to my friends "
265416,"Colorful 6-bed-room in Berlin",9,"Andrea,Jonas","The Sunflower hostel was everything I expected and more! 
As a female solo traveler I felt welcomed and always safe at this place regardless of how many people was staying in it. The lockers were reliable and I am happy I took my own lock. Sheets were clean, the colors of the room were super cute and the bathroom was big, private, safe and clean. The location is ideal, only a few stations from the center and other cool areas to visit, don't stick to one place only! This location really allows you to move around. 
I was also happy that regardless of the night lifestyle most people at the hostel were looking for, the rooms were pretty quiet and no one got crazy within hostel's territory. So don't worry if your roommates are going all out at night, you don't necessarily need to be part of it. Breakfast was also great, although 3EUR per person in order to have it which should be stated at the hostel's profile. Besides from that, I know I would come back to this place in a heartbeat and i"
265416,"Colorful 6-bed-room in Berlin",9,Dmitrii,"This is a nice place to stay in Berlin alone or with someone or company. Closer to U and S, time to some places takes about thirty minutes. First floor is great place to enjoy before sleep - you can meet with someone easy if need. Also, breakfast is good option. Thank you, Sunflower!"
265416,"Colorful 6-bed-room in Berlin",9,"María Fernanda","Great place "
265416,"Colorful 6-bed-room in Berlin",9,Ivan,"Sunflower es el lugar perfecto para la gente atípica y alternativa, excelente ambiente y ubicación. La gente q trabaja en el lugar "rocks" y por las noches si quieres estar en el bar abierto hasta las 5am conoces todo tipo d gente interesante. Muy recomendable"
265416,"Colorful 6-bed-room in Berlin",9,Marcos,"Sitio agradable"
